#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-KuJTo64dmWvVWKcz

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_droplet_snapshot.original-main-snapshot: Refreshing state... [id=126133672]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_ssh_key.tara: Refreshing state... [id=38240725]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.opentracker-testing: Refreshing state... [id=1696593050]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_role.ec2_primary: Refreshing state... [id=ec2-primary]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_instance_profile.ec2_primary: Refreshing state... [id=ec2-profile]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_security_group.http: Refreshing state... [id=sg-065a412fecefab781]
aws_security_group.inbound_http: Refreshing state... [id=sg-0a04ba8fd38ce68c9]
aws_security_group.https: Refreshing state... [id=sg-0a3410176c57a9dcb]
aws_security_group.ssh: Refreshing state... [id=sg-07a113216ea602a4f]
aws_security_group.inbound_https: Refreshing state... [id=sg-0b9c6e22f2a63fce9]
aws_security_group.postgres: Refreshing state... [id=sg-0e4218e5cefa26b24]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3902821458]
aws_security_group_rule.allow_outbound_http_return: Refreshing state... [id=sgrule-4180701166]
aws_security_group_rule.allow_ephemeral_http_return: Refreshing state... [id=sgrule-1480824257]
aws_security_group_rule.allow_inbound_http: Refreshing state... [id=sgrule-20593255]
aws_security_group_rule.allow_ephemeral_https_return: Refreshing state... [id=sgrule-3088169964]
aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-2231607179]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3725321253]
aws_security_group_rule.allow_outbound_https_return: Refreshing state... [id=sgrule-691814140]
aws_security_group_rule.allow_postgres_return: Refreshing state... [id=sgrule-2072332023]
aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-2104780721]
aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1461435279]
aws_instance.primary: Refreshing state... [id=i-034f6ba06175e3118]
aws_security_group_rule.allow_ephemeral_ssh_return: Refreshing state... [id=sgrule-139332016]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
aws_iam_policy.ec2_primary: Refreshing state... [id=arn:aws:iam::558855412466:policy/ec2-primary-policy]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
aws_iam_role_policy_attachment.ec2_primary: Refreshing state... [id=ec2-primary-20230806154009241400000001]
aws_eip.primary: Refreshing state... [id=eipalloc-09bdf2f5a06f2d778]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.opentracker will be created
  + resource "aws_route53_record" "opentracker" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "@"
      + records         = [
          + "157.245.46.69",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.opentracker-testing will be created
  + resource "aws_route53_record" "opentracker-testing" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "testing"
      + records         = [
          + "63.32.120.39",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.opentracker will be created
  + resource "aws_route53_zone" "opentracker" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "opentracker.app"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>